Documents/ESB/ESB_Consumer_1119/003TestSample/SAMPLE_XML_MUST/DebitCard/DC20_DbCardTxnFnctModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardTxnFnctModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardTxnFnctMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardTxnFnctModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC20</v11:TxnId>  
        <v11:TxnNo>DC2000001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <!--Optional:-->  
        <v11:LcyTxnFlg>Y</v11:LcyTxnFlg>  
        <!--Optional:-->  
        <v11:XbrdrTxnFlg>Y</v11:XbrdrTxnFlg>  
        <!--Optional:-->  
        <v11:XbrdrWdlFlg>Y</v11:XbrdrWdlFlg>  
        <!--Optional:-->  
        <v11:ElekCardAutoLoadFlg>O</v11:ElekCardAutoLoadFlg>  
        <!--Optional:-->  
        <v11:ElekCardFlg>N</v11:ElekCardFlg>  
        <v11:UpdtUserID>joe</v11:UpdtUserID> 
      </v11:ServiceBody> 
    </v11:DbCardTxnFnctModRq> 
  </soap:Body> 
</soap:Envelope>
